KSICreateCollateral_input_request.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <ns30:createCollateral xmlns:ns30="http://ksi.de.db.com/collateralservice" xmlns="http://ksi.de.db.com/businessresult" xmlns:ns10="http://ksi.de.db.com/state" xmlns:ns11="http://ksi.de.db.com/process_item" xmlns:ns12="http://ksi.de.db.com/order" xmlns:ns13="http://ksi.de.db.com/collateral" xmlns:ns14="http://ksi.de.db.com/mortgage_specific" xmlns:ns15="http://ksi.de.db.com/readcollateralwithassets_out" xmlns:ns16="http://ksi.de.db.com/deletion_order" xmlns:ns17="http://ksi.de.db.com/basicOrder" xmlns:ns18="http://ksi.de.db.com/createprocessorder_in" xmlns:ns19="http://ksi.de.db.com/deletecollateral_in" xmlns:ns2="http://ksi.de.db.com/collateral_id" xmlns:ns20="http://ksi.de.db.com/businessheader" xmlns:ns21="http://ksi.de.db.com/readcollateraloverview_out" xmlns:ns22="http://ksi.de.db.com/findcollateral_out" xmlns:ns23="http://ksi.de.db.com/deletecollateral_out" xmlns:ns24="http://ksi.de.db.com/createdocument_out" xmlns:ns25="http://ksi.de.db.com/findcollateral_in" xmlns:ns26="http://ksi.de.db.com/createdocument_in" xmlns:ns27="http://ksi.de.db.com/createcollateral_in" xmlns:ns28="http://ksi.de.db.com/readcollateraloverview_in" xmlns:ns29="http://ksi.de.db.com/readcollateral_in" xmlns:ns3="http://ksi.de.db.com/createprocessorder_out" xmlns:ns31="http://ksi.de.db.com/readcollateralwithassets_in" xmlns:ns32="http://ksi.de.db.com/readcollateral_out" xmlns:ns33="http://ksi.de.db.com/partner_information" xmlns:ns34="http://ksi.de.db.com/createcollateral_out" xmlns:ns4="http://ksi.de.db.com/value" xmlns:ns5="http://ksi.de.db.com/collateral_basic" xmlns:ns6="http://ksi.de.db.com/collateral_type" xmlns:ns7="http://ksi.de.db.com/evaluation" xmlns:ns8="http://ksi.de.db.com/reasonDeviation" xmlns:ns9="http://ksi.de.db.com/bauspar_debtor">
         <ns27:create_collateral_in>
            <ns20:business_header version="2.00">
               <ns20:user>
                  <ns20:user_id>ZX3007</ns20:user_id>
                  <ns20:password>zx300000</ns20:password>
               </ns20:user>
               <ns20:customer>
                  <ns20:customer_id>KM KSI TESTING</ns20:customer_id>
                  <ns20:event_timestamp>2014-07-07T13:38:07.119</ns20:event_timestamp>
               </ns20:customer>
            </ns20:business_header>
            <ns13:collateral>
               <ns13:cession>
                  <ns5:collateral_basic>
                     <ns2:collateral_id>
                        <ns2:ksi_classic_collateral_identifier>
                           <ns2:branch_account_number>6150300178</ns2:branch_account_number>
                        </ns2:ksi_classic_collateral_identifier>
                     </ns2:collateral_id>
                     <ns6:collateral_type>
                        <ns6:id>315</ns6:id>
                     </ns6:collateral_type>
                     <ns5:client_type>2</ns5:client_type>
                     <ns5:gbm>5</ns5:gbm>
                     <ns5:date_contract_conclusion>2010-11-11+01:00</ns5:date_contract_conclusion>
                     <ns7:evaluation>
                        <ns7:liquidation_value>
                           <ns7:amount>47000.0</ns7:amount>
                           <ns7:currency>EUR</ns7:currency>
                        </ns7:liquidation_value>
                        <ns7:date_evaluation>2010-11-11+01:00</ns7:date_evaluation>
                        <ns7:evaluator>ZX3007</ns7:evaluator>
                     </ns7:evaluation>
                     <ns5:collateral_purpose>
                        <ns5:purpose_type>
                           <ns5:narrow_purpose_type>
                              <ns5:ksi_classic_collateral_debtor>
                                 <ns5:debtor>
                                    <ns5:branch_account_number>6150300178</ns5:branch_account_number>
                                    <ns5:client_type>2</ns5:client_type>
                                    <ns5:single_loan>
                                       <ns5:credit_system_type>KK</ns5:credit_system_type>
                                       <ns5:currency>EUR</ns5:currency>
                                       <ns5:subaccount>
                                          <ns5:kk>
                                             <ns5:subaccount_number>41</ns5:subaccount_number>
                                          </ns5:kk>
                                       </ns5:subaccount>
                                    </ns5:single_loan>
                                    <ns5:single_loan>
                                       <ns5:credit_system_type>KK</ns5:credit_system_type>
                                       <ns5:currency>EUR</ns5:currency>
                                       <ns5:subaccount>
                                          <ns5:kk>
                                             <ns5:subaccount_number>00</ns5:subaccount_number>
                                          </ns5:kk>
                                       </ns5:subaccount>
                                    </ns5:single_loan>
                                 </ns5:debtor>
                              </ns5:ksi_classic_collateral_debtor>
                           </ns5:narrow_purpose_type>
                        </ns5:purpose_type>
                     </ns5:collateral_purpose>
                     <ns5:provider_of_collateral>
                        <ns5:branch_account_number>6150300178</ns5:branch_account_number>
                        <ns5:partner_id>8710030516000</ns5:partner_id>
                        <ns5:client_type>2</ns5:client_type>
                     </ns5:provider_of_collateral>
                     <ns12:order>
                        <ns11:process_item>
                           <ns11:text>Auftrag zur Bearbeitung einer Sicherheit-Verrechnungsstellen vom 07.07.2014</ns11:text>
                           <ns11:shorttext>Erstellung- Verrechnungsstellen</ns11:shorttext>
                           <ns11:type>CreationOrder</ns11:type>
                           <ns11:sender_id>ZX3007</ns11:sender_id>
                        </ns11:process_item>
               		 <ns12:order_text>Bitte legen Sie folgende neue Sicherheit in KSI an :SicherheitenNr:  615 0300178 Sicherheitenart:  Verrechnungsstellen sad</ns12:order_text>
                     </ns12:order>
                     <ns5:short_description>123456789</ns5:short_description>
                  </ns5:collateral_basic>
                  <ns13:specific>
                     <ns13:sas315>
                        <ns13:type_claim>Ansprüche gegen sonstige Verrechnungsstellen</ns13:type_claim>
                        <ns13:clearing_entity>
                           <ns13:name_details>
                              <ns13:name>Check</ns13:name>
                           </ns13:name_details>
                        </ns13:clearing_entity>
                        <ns13:add_valuation_details>
                           <ns13:across_the_board_turnaround>
                              <ns4:value>
                                 <ns4:amount>565939.0</ns4:amount>
                                 <ns4:currency>EUR</ns4:currency>
                              </ns4:value>
                           </ns13:across_the_board_turnaround>
                           <ns13:assessable_monthly_turnaround>
                              <ns13:amount>47161.583333333336</ns13:amount>
                              <ns13:currency>EUR</ns13:currency>
                              <ns13:date>2010-11-11+01:00</ns13:date>
                           </ns13:assessable_monthly_turnaround>
                           <ns13:discount_nominal_value>0.0034261643039267993</ns13:discount_nominal_value>
                        </ns13:add_valuation_details>
                        <ns13:maximum_amount>
                           <ns4:value>
                              <ns4:amount>47161.583333333336</ns4:amount>
                              <ns4:currency>EUR</ns4:currency>
                           </ns4:value>
                        </ns13:maximum_amount>
                        <ns13:claim_details_sas315>
                           <ns13:medical_specialist_group>Pathologe</ns13:medical_specialist_group>
                           <ns13:state>West (einschl. Berlin)</ns13:state>
                           <ns13:business_start_up>nein</ns13:business_start_up>
                        </ns13:claim_details_sas315>
                     </ns13:sas315>
                  </ns13:specific>
               </ns13:cession>
            </ns13:collateral>
         </ns27:create_collateral_in>
      </ns30:createCollateral>
   </S:Body>
</S:Envelope>